In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(data={'id':[1,1,1,2,2,2], 'a':[1,2,np.nan,4,np.nan,6], 'b':[np.nan,np.nan,np.nan,13, np.nan,15], 'c':[1,2,4,5,6,np.nan]})
df

   id    a     b    c
0   1  1.0   NaN  1.0
1   1  2.0   NaN  2.0
2   1  NaN   NaN  4.0
3   2  4.0  13.0  5.0
4   2  NaN   NaN  6.0
5   2  6.0  15.0  NaN

In [3]:
#df.loc[:, ['a', 'c']].replace([4], [np.nan], inplace=True)
df.loc[:, ['a','c']]=df.loc[:, ['a', 'c']].replace([4], [np.nan])
df

   id    a     b    c
0   1  1.0   NaN  1.0
1   1  2.0   NaN  2.0
2   1  NaN   NaN  NaN
3   2  NaN  13.0  5.0
4   2  NaN   NaN  6.0
5   2  6.0  15.0  NaN

In [4]:
df.loc[:,['b', 'c']]=df.groupby(by=['id'])[['b', 'c']].transform(lambda x: x.interpolate())
df

   id    a     b    c
0   1  1.0   NaN  1.0
1   1  2.0   NaN  2.0
2   1  NaN   NaN  2.0
3   2  NaN  13.0  5.0
4   2  NaN  14.0  6.0
5   2  6.0  15.0  6.0

In [5]:
df.isna().sum()

id    0
a     3
b     3
c     0
dtype: int64

In [10]:
df['d']=df.groupby(by='id')[['c']].transform(lambda x : x.shift(+1))

In [11]:
df

   id    a     b    c    d
0   1  1.0   NaN  1.0  NaN
1   1  2.0   NaN  2.0  1.0
2   1  NaN   NaN  2.0  2.0
3   2  NaN  13.0  5.0  NaN
4   2  NaN  14.0  6.0  5.0
5   2  6.0  15.0  6.0  6.0

In [12]:
df1 = pd.read_excel('../../../datalcdem/data/optima/optima_excel/Data_Request_Jan_2019_final.xlsx')

In [22]:
df1[[col for col in df1.columns.tolist() if 'DEPRESSIVE ILLNESS' in col]].iloc[:,0].unique()

array([9, nan, 1, 0, 'mixed mitral & Aortic Valve disease',
       'left homonymous hemianopia under anaesthetic for TURP 1987',
       'Bilateral knee replacements', 'caesarian section (GA)'],
      dtype=object)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]